// From MacBuddy
// ---------------------------------------------------------------------
// * Buttons
// ---------------------------------------------------------------------
"OK_BUTTON"		= "OK";
"CANCEL_BUTTON"		= "Kumoa";
"GOBACK_BUTTON"		= "Takaisin";
"DIAGNOSE_BUTTON"	= "Määritä";

// ---------------------------------------------------------------------
// * Progress message
// ---------------------------------------------------------------------
"MESSAGE_CONFIGURING"		= "Määrittelen tietokonetta...";
"MESSAGE_PREP_CONNECTION"	= "Valmistelen yhteyttä...";

// ---------------------------------------------------------------------
// * Fatal error
// ---------------------------------------------------------------------
"FATAL_ERROR_PANEL_TITLE"		= "Odottamaton virhe";
"MESSAGE_FATAL_ERROR_TITLE"		= "Tapahtui odottamaton virhe.";

// ---------------------------------------------------------------------
// * Generic error
// ---------------------------------------------------------------------
"GENERIC_ERROR_PANEL_TITLE"				= "Virhe";
"ERROR_MESSAGE_GENERIC_TITLE"			= "Pahoittelen...";


// ---------------------------------------------------------------------
// * Data Validation
// ---------------------------------------------------------------------
"ERROR_MESSAGE_VALIDATION_FAILED_TITLE" = "Valitan";
"ERROR_MESSAGE_VALIDATION_WARNING_TITLE" = "Varoitus";
"ERROR_MESSAGE_VALIDATION_WARNING" = "Haluatko jatkaa?";

                    // Required field
"ERROR_MESSAGE_VALIDATION_0001_TITLE" = "Et ole antanut kaikkea pyydettyä tietoa.";
"ERROR_MESSAGE_VALIDATION_0001" = "Tarkista punaisilla nuolilla merkityt kentät ja anna pyydetyt tiedot.";

                    // Min-length field
"ERROR_MESSAGE_VALIDATION_0002_TITLE" = "Antamasi teksti on liian lyhyt.";
"ERROR_MESSAGE_VALIDATION_0002" = "Tarkista korostettu kenttä ja korjaa tiedot.";

                    // Matching fields (e.g. password)
"ERROR_MESSAGE_VALIDATION_0003" = "Antamasi tieto on väärää.";

                    // NI Username invalid
"ERROR_MESSAGE_VALIDATION_0004_TITLE" = "Antamasi käyttäjätunnus ei ole kelvollinen.";
"ERROR_MESSAGE_VALIDATION_0004" = "Tarkista korostettu kenttä ja anna kelvollinen käyttäjätunnus NetInfo-verkkoon.";

                    // NI Password invalid
"ERROR_MESSAGE_VALIDATION_0005_TITLE" = "Antamasi salasana on väärä.";
"ERROR_MESSAGE_VALIDATION_0005" = "Tarkista korostettu kenttä ja anna oikea salasana.";

                    // UnixName invalid		-- refer to UsersPref
"ERROR_MESSAGE_VALIDATION_0006_TITLE" = "Antamaasi nimeä ei voida käyttää.";
"ERROR_MESSAGE_VALIDATION_0006" = "Tarkista korostettu kenttä ja anna toinen käyttäjätunnus.";
"ERROR_MESSAGE_VALIDATION_0007" = "Käyttäjätunnus on jo käytössä. Anna toinen käyttäjätunnus.";

                    // IPAddress invalid	-- refer to Open Transport
					// "ERROR_MESSAGE_VALIDATION_0008" - NSIPAddressIsValid
"ERROR_MESSAGE_VALIDATION_0009" = "Antamasi IP-osoite on tyhjä.";
"ERROR_MESSAGE_VALIDATION_0010" = "Antamasi IP-osoite sisältää virheellisiä merkkejä.";
"ERROR_MESSAGE_VALIDATION_0011_TITLE" = "Osoitteessa täytyy olla neljä osaa."; // too few segments
"ERROR_MESSAGE_VALIDATION_0011" = "Tarkista korostettu kenttä ja anna oikea osoite. Jos et tiedä osoitetta, kysy sitä verkon ylläpitäjältä.";
"ERROR_MESSAGE_VALIDATION_0012_TITLE" = "Osoitteessa täytyy olla neljä osaa."; // too many segments
"ERROR_MESSAGE_VALIDATION_0012" = "Tarkista korostettu kenttä ja anna oikea osoite. Jos et tiedä osoitetta, kysy sitä verkon ylläpitäjältä.";
"ERROR_MESSAGE_VALIDATION_0013_TITLE" = "Osoitteen jokaisen osan tulee olla 1 - 3 merkkiä."; // no segments
"ERROR_MESSAGE_VALIDATION_0013" = "Tarkista korostettu kenttä ja anna oikea osoite. Jos et tiedä osoitetta, kysy sitä verkon ylläpitäjältä.";
"ERROR_MESSAGE_VALIDATION_0014_TITLE" = "Antamasi osoite ei ole sallittu.";
"ERROR_MESSAGE_VALIDATION_0014" = "Tarkista korostettu kenttä ja anna oikea osoite. Jos et tiedä osoitetta, kysy sitä verkon ylläpitäjältä.";

                    // SubnetMask invalid
"ERROR_MESSAGE_VALIDATION_0015_TITLE" = "Antamasi aliverkon maski on väärä.";
"ERROR_MESSAGE_VALIDATION_0015" = "Tarkista korostettu kenttä ja anna oikea aliverkon maski. Jos et tiedä osoitetta, kysy sitä verkon ylläpitäjältä.";

                    // notNIUsername
"ERROR_MESSAGE_VALIDATION_0016" = "Antamasi tunnus löytyy jo NetInfo-verkosta. Et voi kirjautua NetInfo-verkkoon tällä tunnuksella.";

                    // Unique fields
"ERROR_MESSAGE_VALIDATION_0017" = "Samaa arvoa ei voida käyttää.";

                    // Wireless Network password
"ERROR_MESSAGE_VALIDATION_0018" = "Antamasi salasana on väärä.";

"ERROR_MESSAGE_VALIDATION_0019_TITLE" = "Antamaasi luottokorttinumeroa ei voida käyttää.";
"ERROR_MESSAGE_VALIDATION_0019" = "Tarkista korostettu kenttä ja anna oikea luottokorttinumero.";

                    // Account name
"ERROR_MESSAGE_VALIDATION_0020" = "Käyttäjätunnus ei voi alkaa numerolla.";

                    // EMail address
"ERROR_MESSAGE_VALIDATION_0021" = "Antamasi sähköpostiosoite saattaa olla käyttökelvoton.";

                    // SubnetMask & IPAddress, Router consistency check
"ERROR_MESSAGE_VALIDATION_0022" = "IP-osoite ja reitittimen osoite eivät ole yhdenmukaisia antamasi aliverkon maskin kanssa. Tarkista seuraavat kentät ja anna oikeat arvot:\n     IP-osoite\n     Aliverkon maski\n     Reitittimen osoite\nJos et ole varma asetuksesta, kysy sitä verkon ylläpitäjältä ennen kuin jatkat.";

                    // Wrong long username
"ERROR_MESSAGE_VALIDATION_0023_TITLE" = "Antamaasi nimeä ei voida käyttää.";
"ERROR_MESSAGE_VALIDATION_0023" = "Tarkista korostettu kenttä ja valitse toinen nimi.";

                    // Unique Array
"ERROR_MESSAGE_VALIDATION_0024_TITLE" = "Arvoja on kaksi.";
"ERROR_MESSAGE_VALIDATION_0024" = "Tarkista korostettu kenttä ja anna yksilöllisiä arvoja.";

// ---------------------------------------------------------------------
// * System Configuration
// ---------------------------------------------------------------------
"MESSAGE_NO_DIAL_TONE_TITLE"			= "Modeemisi ei havaitse valintaääntä.";
"MESSAGE_NO_DIAL_TONE"					= "Varmista, että modeemi on liitetty ja sitten OK. Voit myös palata taaksepäin osoittamalla Kumoa ja valita Älä huomioi valintaääntä -valintaneliön.";

// ========== Network Setup Assistant addition ==========
"QUIT_BUTTON"		= "Lopeta";
                                        // Field specific errors
"ERROR_PASSWORD_DO_NOT_MATCH_TITLE" = "Salasanat eivät täsmää.";
"ERROR_PASSWORD_DO_NOT_MATCH" = "Tarkista punaisilla nuolilla merkityt kentät ja anna sama salasana molempiin kenttiin.";

"ERROR_MUST_ENTER_LOCATION_NAME_TITLE" = "Anna sijainnille nimi.";
"ERROR_MUST_ENTER_LOCATION_NAME" = "Olet luomassa uutta verkkosijaintia, jonne määrittelytiedot tallennetaan. Anna sijainnille nimi nyt.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME_TITLE" = "Anna toinen sijainnin nimi.";
"ERROR_MUST_ENTER_UNIQUE_LOCATION_NAME" = "Syötetty sijaintinimi on jo olemassa. Syötä toinen nimi.";


"MESSAGE_TASK_FORMAT" = "Yhteys: %1$@, menetelmä: %2$@"; // %1$@ = CONNECTION, %2$@ = CONFIGURATION
"CONNECTION_Wireless" = "Langaton";
"CONNECTION_Modem" = "Modeemi";
"CONNECTION_DSL" = "DSL";
"CONNECTION_CableModem" = "Kaapelimodeemi";
"CONNECTION_Lan" = "Lähiverkko (LAN)";
"CONFIGURE_PPP" = "PPP";
"CONFIGURE_DHCP" = "DHCP";
"CONFIGURE_DHCPClientID" = "DHCP-asiakastunnuksella";
"CONFIGURE_PPPoE" = "PPPoE";
"CONFIGURE_Manual" = "Kiinteä IP";

"MESSAGE_TITLE_CONFIGURE" = "Määrittelen...";
"MESSAGE_FAILED_CONFIGURE" = "Määrittely epäonnistui.";
"MESSAGE_DONE_CONFIGURE" = "Määrittely valmis.";
"MESSAGE_CHECKING_CONNECTION" = "Tarkistan verkkoyhteyttä...";
"MESSAGE_CONNECTED" = "Verkkoyhteys luotu.";
"MESSAGE_NOT_CONNECTED" = "Verkkoyhteyttä ei voida muodostaa.";
"MESSAGE_NOT_CONNECTED_TRY_AGAIN" = "Tietokoneesi ei saanut yhteyttä internetiin. Palaa osoittamalla OK, muuta verkkoasetuksia ja yritä sitten uudelleen.";

"DEFAULT_LOCATION_NAME" = "Käyttöpaikka (%@)";
"DUPLICATE_LOCATION_NAME" = "%1$@ %2$d";